# TemporaryGraphicsCommandData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemporaryGraphicsCommandData Class
Members See Also
---
The context data that can be provided to OnClick(TemporaryGraphicsCommandData).
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public class TemporaryGraphicsCommandData : IExternalData,
	IDisposable
```

Visual Basic
---
```text
Public Class TemporaryGraphicsCommandData _
	Implements IExternalData, IDisposable
```

Visual C++
---
```text
public ref class TemporaryGraphicsCommandData : IExternalData,
	IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..TemporaryGraphicsCommandData
# See Also
TemporaryGraphicsCommandData Members
Autodesk.Revit.UI Namespace